In [21]:
import pandas
df = pandas.read_excel('titanic3.xls')

In [22]:
#check each 
#print(df)
sex = {'male': 0,'female': 1} 
df.sex = [sex[item] for item in df.sex] 
#print(df)

In [26]:
#remove dups
#sorting by  name 
df.sort_values("name", inplace = True) 
  
#dropping ALL duplicte values 
df.drop_duplicates(subset ="name", 
                     keep = False, inplace = True) 
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
600,3,0,"Abbing, Mr. Anthony",0,42.0,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,NaN
601,3,0,"Abbott, Master. Eugene Joseph",0,13.0,0,2,C.A. 2673,20.25,NaN,S,NaN,NaN,"East Providence, RI"
602,3,0,"Abbott, Mr. Rossmore Edward",0,16.0,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI"
603,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",1,35.0,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI"
604,3,1,"Abelseth, Miss. Karen Marie",1,16.0,0,0,348125,7.65,NaN,S,16,NaN,"Norway Los Angeles, CA"

In [30]:
#sum total survivied
Sumsurvivied = sum(df.survived) 
print(Sumsurvivied)

499

In [31]:
print(df)

      pclass  survived                                             name  sex  \
600        3         0                              Abbing, Mr. Anthony    0
601        3         0                    Abbott, Master. Eugene Joseph    0
602        3         0                      Abbott, Mr. Rossmore Edward    0
603        3         1                 Abbott, Mrs. Stanton (Rosa Hunt)    1
604        3         1                      Abelseth, Miss. Karen Marie    1
605        3         1                    Abelseth, Mr. Olaus Jorgensen    0
323        2         0                              Abelson, Mr. Samuel    0
324        2         1            Abelson, Mrs. Samuel (Hannah Wizosky)    1
606        3         1         Abrahamsson, Mr. Abraham August Johannes    0
607        3         1        Abrahim, Mrs. Joseph (Sophie Halaut Easu)    1
608        3         0                   Adahl, Mr. Mauritz Nils Martin    0
609        3         0                                  Adams, Mr. John    0
610        3         0   Ahlin, Mrs. Johan (Johanna Persdotter Larsson)    1
611        3         1                        Aks, Master. Philip Frank    0
612        3         1                       Aks, Mrs. Sam (Leah Rosen)    1
613        3         1                      Albimona, Mr. Nassef Cassem    0
325        2         0                   Aldworth, Mr. Charles Augustus    0
614        3         0                           Alexander, Mr. William    0
615        3         0                      Alhomaki, Mr. Ilmari Rudolf    0
616        3         0                                   Ali, Mr. Ahmed    0
617        3         0                                 Ali, Mr. William    0
0          1         1                    Allen, Miss. Elisabeth Walton    1
618        3         0                         Allen, Mr. William Henry    0
1          1         1                   Allison, Master. Hudson Trevor    0
2          1         0                     Allison, Miss. Helen Loraine    1
3          1         0             Allison, Mr. Hudson Joshua Creighton    0
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    1
619        3         0                           Allum, Mr. Owen George    0
620        3         0                      Andersen, Mr. Albert Karvin    0
621        3         1  Andersen-Jensen, Miss. Carla Christine Nielsine    1
...      ...       ...                                              ...  ...
1295       3         0                              Windelov, Mr. Einar    0
1296       3         0                                 Wirz, Mr. Albert    0
1297       3         0                           Wiseman, Mr. Phillippe    0
1298       3         0                        Wittevrongel, Mr. Camille    0
320        1         1                                Woolner, Mr. Hugh    0
598        2         1                             Wright, Miss. Marion    1
321        1         0                               Wright, Mr. George    0
1299       3         0                              Yasbeck, Mr. Antoni    0
1300       3         1          Yasbeck, Mrs. Antoni (Selini Alexander)    1
322        1         1                         Young, Miss. Marie Grice    1
1301       3         0                             Youseff, Mr. Gerious    0
1302       3         0                                Yousif, Mr. Wazli    0
1303       3         0                            Yousseff, Mr. Gerious    0
599        2         0           Yrois, Miss. Henriette ("Mrs Harbeck")    1
1304       3         0                             Zabour, Miss. Hileni    1
1305       3         0                            Zabour, Miss. Thamine    1
1306       3         0                        Zakarian, Mr. Mapriededer    0
1307       3         0                              Zakarian, Mr. Ortin    0
1308       3         0                               Zimmerman, Mr. Leo    0
389        2         0                       de Brito, Mr. Jose Joaquim    0
758        3         1             de Messemaeker, Mr. Guillaume Joseph    0
759        3         1     de Messemaeker, Mrs. Guillaume Joseph (Emma)    1
760        3         1                          de Mulder, Mr. Theodore    0
761        3         0                        de Pelsmaeker, Mr. Alfons    0
391        2         0                        del Carlo, Mr. Sebastiano    0
392        2         1    del Carlo, Mrs. Sebastiano (Argenia Genovesi)    1
1262       3         0              van Billiard, Master. James William    0
1263       3         0                van Billiard, Master. Walter John    0
1264       3         0                  van Billiard, Mr. Austin Blyler    0
1268       3         0                      van Melkebeke, Mr. Philemon    0

          age  sibsp  parch              ticket      fare    cabin embarked  \
600   42.0000      0      0           C.A. 5547    7.5500      NaN        S
601   13.0000      0      2           C.A. 2673   20.2500      NaN        S
602   16.0000      1      1           C.A. 2673   20.2500      NaN        S
603   35.0000      1      1           C.A. 2673   20.2500      NaN        S
604   16.0000      0      0              348125    7.6500      NaN        S
605   25.0000      0      0              348122    7.6500    F G63        S
323   30.0000      1      0           P/PP 3381   24.0000      NaN        C
324   28.0000      1      0           P/PP 3381   24.0000      NaN        C
606   20.0000      0      0    SOTON/O2 3101284    7.9250      NaN        S
607   18.0000      0      0                2657    7.2292      NaN        C
608   30.0000      0      0              C 7076    7.2500      NaN        S
609   26.0000      0      0              341826    8.0500      NaN        S
610   40.0000      1      0                7546    9.4750      NaN        S
611    0.8333      0      1              392091    9.3500      NaN        S
612   18.0000      0      1              392091    9.3500      NaN        S
613   26.0000      0      0                2699   18.7875      NaN        C
325   30.0000      0      0              248744   13.0000      NaN        S
614   26.0000      0      0                3474    7.8875      NaN        S
615   20.0000      0      0    SOTON/O2 3101287    7.9250      NaN        S
616   24.0000      0      0  SOTON/O.Q. 3101311    7.0500      NaN        S
617   25.0000      0      0  SOTON/O.Q. 3101312    7.0500      NaN        S
0     29.0000      0      0               24160  211.3375       B5        S
618   35.0000      0      0              373450    8.0500      NaN        S
1      0.9167      1      2              113781  151.5500  C22 C26        S
2      2.0000      1      2              113781  151.5500  C22 C26        S
3     30.0000      1      2              113781  151.5500  C22 C26        S
4     25.0000      1      2              113781  151.5500  C22 C26        S
619   18.0000      0      0                2223    8.3000      NaN        S
620   32.0000      0      0              C 4001   22.5250      NaN        S
621   19.0000      1      0              350046    7.8542      NaN        S
...       ...    ...    ...                 ...       ...      ...      ...
1295  21.0000      0      0    SOTON/OQ 3101317    7.2500      NaN        S
1296  27.0000      0      0              315154    8.6625      NaN        S
1297      NaN      0      0          A/4. 34244    7.2500      NaN        S
1298  36.0000      0      0              345771    9.5000      NaN        S
320       NaN      0      0               19947   35.5000      C52        S
598   26.0000      0      0              220844   13.5000      NaN        S
321   62.0000      0      0              113807   26.5500      NaN        S
1299  27.0000      1      0                2659   14.4542      NaN        C
1300  15.0000      1      0                2659   14.4542      NaN        C
322   36.0000      0      0            PC 17760  135.6333      C32        C
1301  45.5000      0      0                2628    7.2250      NaN        C
1302      NaN      0      0                2647    7.2250      NaN        C
1303      NaN      0      0                2627   14.4583      NaN        C
599   24.0000      0      0              248747   13.0000      NaN        S
1304  14.5000      1      0                2665   14.4542      NaN        C
1305      NaN      1      0                2665   14.4542      NaN        C
1306  26.5000      0      0                2656    7.2250      NaN        C
1307  27.0000      0      0                2670    7.2250      NaN        C
1308  29.0000      0      0              315082    7.8750      NaN        S
389   32.0000      0      0              244360   13.0000      NaN        S
758   36.5000      1      0              345572   17.4000      NaN        S
759   36.0000      1      0              345572   17.4000      NaN        S
760   30.0000      0      0              345774    9.5000      NaN        S
761   16.0000      0      0              345778    9.5000      NaN        S
391   29.0000      1      0       SC/PARIS 2167   27.7208      NaN        C
392   24.0000      1      0       SC/PARIS 2167   27.7208      NaN        C
1262      NaN      1      1            A/5. 851   14.5000      NaN        S
1263  11.5000      1      1            A/5. 851   14.5000      NaN        S
1264  40.5000      0      2            A/5. 851   14.5000      NaN        S
1268      NaN      0      0              345777    9.5000      NaN        S

     boat   body                                          home.dest
600   NaN    NaN                                                NaN
601   NaN    NaN                                East Providence, RI
602   NaN  190.0                                East Providence, RI
603     A    NaN                                East Providence, RI
604    16    NaN                             Norway Los Angeles, CA
605     A    NaN                                 Perkins County, SD
323   NaN    NaN                                Russia New York, NY
324    10    NaN                                Russia New York, NY
606    15    NaN                  Taalintehdas, Finland Hoboken, NJ
607     C    NaN                                     Greensburg, PA
608   NaN   72.0                        Asarum, Sweden Brooklyn, NY
609   NaN  103.0                               Bournemouth, England
610   NaN    NaN                                  Sweden Akeley, MN
611    11    NaN                        London, England Norfolk, VA
612    13    NaN                        London, England Norfolk, VA
613    15    NaN                           Syria Fredericksburg, VA
325   NaN    NaN                                 Bryn Mawr, PA, USA
614   NaN    NaN                                 England Albion, NY
615   NaN    NaN                          Salo, Finland Astoria, OR
616   NaN    NaN                                                NaN
617   NaN   79.0                                          Argentina
0       2    NaN                                       St Louis, MO
618   NaN    NaN  Lower Clapton, Middlesex or Erdington, Birmingham
1      11    NaN                    Montreal, PQ / Chesterville, ON
2     NaN    NaN                    Montreal, PQ / Chesterville, ON
3     NaN  135.0                    Montreal, PQ / Chesterville, ON
4     NaN    NaN                    Montreal, PQ / Chesterville, ON
619   NaN  259.0                      Windsor, England New York, NY
620   NaN  260.0                                     Bergen, Norway
621    16    NaN                                                NaN
...   ...    ...                                                ...
1295  NaN    NaN                                                NaN
1296  NaN  131.0                                                NaN
1297  NaN    NaN                                                NaN
1298  NaN    NaN                                                NaN
320     D    NaN                                    London, England
598     9    NaN                Yoevil, England / Cottage Grove, OR
321   NaN    NaN                                        Halifax, NS
1299    C    NaN                                                NaN
1300  NaN    NaN                                                NaN
322     8    NaN                      New York, NY / Washington, DC
1301  NaN  312.0                                                NaN
1302  NaN    NaN                                                NaN
1303  NaN    NaN                                                NaN
599   NaN    NaN                                              Paris
1304  NaN  328.0                                                NaN
1305  NaN    NaN                                                NaN
1306  NaN  304.0                                                NaN
1307  NaN    NaN                                                NaN
1308  NaN    NaN                                                NaN
389   NaN    NaN                       Portugal / Sau Paulo, Brazil
758    15    NaN                                        Tampico, MT
759    13    NaN                                        Tampico, MT
760    11    NaN                                Belgium Detroit, MI
761   NaN    NaN                                                NaN
391   NaN  295.0                          Lucca, Italy / California
392    12    NaN                          Lucca, Italy / California
1262  NaN    NaN                                                NaN
1263  NaN    1.0                                                NaN
1264  NaN  255.0                                                NaN
1268  NaN    NaN                                                NaN

[1305 rows x 14 columns]